gitorious_book.org
#+TITLE:     The Gitorious Book
#+EMAIL:     support@gitorious.org
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS: H:3 num:nil toc:t @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+BEGIN_HTML
<p><strong>This is the new, official Gitorious
 documentation and is a work in progress.</strong> New content will
 arrive here gradually. In the meantime, please seek out the <a
 href="http://gitorious.org/gitorious/pages/Home">project wiki</a> or
 the Gitorious <a
 href="http://groups.google.com/group/gitorious?hl=en">Google
 group</a> for documentation and troubleshooting.</p>
#+END_HTML


* Introduction
* How Gitorious works
** Features & benefits
** Overview: services, processes, packages
** How the web frontend works
   Briefly describe Rails/web architecture
** How the git backend works
File structure, how we handle incoming ssh/git operations, the gitorious script
** FOSS licensing
** Gitorious AS services
* Installation
** Overview - common steps
** Distro specific instructions
*** CentOS / RHEL
*** Debian / Ubuntu
* Upgrades

** Approach 1: Upgrade current software

git pull origin master | git pull origin TAG/VERSION
git submodule init
db:migrate
rake assets:clear
touch tmp/restart.txt

** Approach 2: Snapshot old instance, reinstall, restore old state

* Using the web frontend
(Tour of the UI, how to do stuff. Add after UI overhaul)
* Authentication & authorization
** LDAP integration
** Private projects/repositories
* Keeping your site up
** Monit
** Diagnostics
* Backup & disaster recovery
* Scaling
** Caching with Vagrant
** Horizontal scaling
   what sort of hardware will you need to keep a single server running
   under misc typical usage scenarios?
** Vertical scaling
   distributing the load over multiple serves
** Repository hashing/sharding
* Troubleshooting
** Current common sticking points
*** Repo creation getting stuck
*** ...
* Developing
** Setting up your development environment
** Submitting patches and merge requests
* Contributing
** Bug reports
** Merge Requests
** Community funded features
* Need more help?
** Google Group
** #gitorious on IRC
** Gitorious AS services & products
* Feedback
* Frequently Asked Questions
